// Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2;
//  значения b1, k1, b2 и k2 задаются пользователем.
// Console.Write("Введите значение координаты k1 первой точки: ");
// double k1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите значение координаты b1 первой точки: ");
// double b1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите значение координаты k2 второй точки: ");
// double k2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите значение координаты b2 второй точки: ");
// double b2 = Convert.ToInt32(Console.ReadLine());
// double x = (b2 - b1)/(k1 - k2);
// double y = k1 * x + b1;
// if (k2 == k1)
// {
//     Console.WriteLine("Не пересекутся");
// }
// else
// {
//     Console.WriteLine($"Прямые пересекутся в точке с координатами ({x},{y})");
// }

